<?php
// $a = -5;
// $b = 5;
// function ext() {
//     // $a = 10;
//     // $b = 10;
//     $f = fn() => $a + $b;
//     return $f();
// }
// $t = $a < 0 ? 'negative': 'positive';
// echo $t;
echo '<h1>Стрелочные функции</h1>', '<br>';
echo '<p>Задание №1</p>';
$r = 5;
$f = fn($r) => 2*3.14 * $r;
echo $f($r);
?>
<?php
echo '<p>Задание №2</p>';
$r = 7;
$t = fn($r) => 3.14*($r**2);
echo "Площадь круга равна: ", $t($r);
?>
<?php
echo '<p>Задание №3</p>';
$a = 9;
$b = 9;
$c = 9;
$p = ($a + $b + $c)/2;
$s = fn($a, $b, $c, $p) => sqrt($p*($p-$a)*($p-$b)*($p-$c));
echo 'Площадь трегольника равно: ', $s($a, $b, $c, $p),'<br>';
?>
<?php
echo '<p>Задание №4</p>';
$a = 5;
$b = 9;
$c = 6;
$p = ($a + $b + $c)/2;
$s = fn($a, $b, $c, $p) => ( $a + $b > $c and $b + $c > $a and $c + $a >$b) ? sqrt($p*($p-$a)*($p-$b)*($p-$c)): 0;
echo 'Площадь трегольника равно: ', $s($a, $b, $c, $p),'<br>';
?>
<?php
echo '<p>Задание №5</p>';
$a = 10;
$b = -10;
$s = fn($a, $b) => $a > $b ? 'a больше b' : ($a < $b ?'a меньше b':'a = b');
?>
<?=$s($a,$b)?>